class Feature(object):
    def __init__(self, index, seq_a, label):
        self.index = index
        self.label = label 
        self.seq = seq_a 
        self.final_adverse = seq_a #
        self.query = 0 #
        self.change = 0 #
        self.success = 0 #
        self.sim = 0.0 #
        self.labse_score = 0.0
        self.chrf_score = 0.0
        self.bert_score = 0.0
        self.changes = [] 
        self.candidates = {}
        self.orig_prob = 0.0 # Original probability with which the model was predicting the correct class
        self.adv_prob = 0.0 # Probability with which the model is predicting the incorrect class after successful adversarial attack
        self.adv_label = label

def get_homoglyph_dict(lang):
    if lang in ['bd','hi']: ### ### Hindi, Bodo
        homoglyph = {"ड":["ड़","ङ"],"ड़":["ड","ङ"],"ङ":["ड़","ड"],"घ":["ध"],"ध":["घ"],
                     "व":["ब"],"ब":["व"],"प":["ष"],"ष":["प"],                     
                     "ट":["ढ"],"ढ":["ट","ढ़","द"],"ढ़":["ढ"],"द":["ढ"],                     
                     "म":["भ"],"भ":["म"],"य":["थ"],"थ":["य"],"क":["फ"],"फ":["क"],
                     "च":["ज"],"ज":["च"],"त":["न"],"न":["त"],"अ":["आ"],"आ":["अ"],"इ":["ई"],"ई":["इ"],
                     "उ":["ऊ"],"ऊ":["उ"],"ए":["ऐ"],"ऐ":["ए"],"ओ":["औ"],"औ":["ओ"]}
    if lang in ['mr']: ### ### Hindi, Bodo
        homoglyph = {"ड":["ड़","ङ"],"ड़":["ड","ङ"],"ङ":["ड़","ड"],"घ":["ध"],"ध":["घ"],
                     "व":["ब"],"ब":["व"],"प":["ष"],"ष":["प"],                     
                     "ट":["ढ"],"ढ":["ट","ढ़","द"],"ढ़":["ढ"],"द":["ढ"],                     
                     "म":["भ"],"भ":["म"],"य":["थ"],"थ":["य"],"क":["फ","ळ"],"फ":["क","ळ"],"ळ":["क","फ"],
                     "च":["ज"],"ज":["च"],"त":["न"],"न":["त"],"अ":["आ"],"आ":["अ"],"इ":["ई"],"ई":["इ"],
                     "उ":["ऊ"],"ऊ":["उ"],"ए":["ऐ"],"ऐ":["ए"],"ओ":["औ"],"औ":["ओ"]}
    if lang in ['bn']:
        homoglyph = {"ত":["ভ"],"ভ":["ত"],"অ":["আ"],"আ":["অ"],"ড":["ড়","উ"],
                     "ড়":["ড"],"উ":["ড","ঊ"],"ঊ":["উ"],"ক":["ফ"],"ফ":["ক"],
                     "এ":["ঐ"],"ঐ":["এ"],"ও":["ঔ"],"ঔ":["ও"],
                     "ঢ":["ট","ঢ়"],"ট":["ঢ"],"ঢ়":["ঢ"],
                     "য":["য়","ষ"],"য়":["য"],"ষ":["য"],"ব":["র"],
                     "র":["ব"],"হ":["ই"],"ই":["হ"],"খ":["থ"],"থ":["খ"]}
    if lang in ['as']:
        homoglyph = {"ত":["ভ"],"ভ":["ত"],"অ":["আ"],"আ":["অ"],"ড":["ড়","উ"],
                     "ড়":["ড"],"উ":["ড","ঊ"],"ঊ":["উ"],"ক":["ফ"],"ফ":["ক"],
                     "এ":["ঐ"],"ঐ":["এ"],"ও":["ঔ"],"ঔ":["ও"],
                     "ঢ":["ট","ঢ়"],"ট":["ঢ"],"ঢ়":["ঢ"],
                     "য":["য়","ষ"],"য়":["য"],"ষ":["য"],"ব":["ৱ","ৰ"],
                     "ৱ":["ব"],"ৰ":["ব"],"হ":["ই"],"ই":["হ"],"খ":["থ"],"থ":["খ"]}        
    if lang in ['gu']:
        homoglyph = {"પ":["ષ","૫"],"ષ":["પ"],"૫":"પ","ચ":["ય"],"ય":["ચ"],"બ":["ખ"],"ખ":["બ"],"જ":["૪"],"૪":["જ"],
                    "ક":["ફ"],"ફ":["ક"],"ઘ":["ધ"],"ધ":["ઘ"],"ર":["૨"],"૨":["ર"],"ઇ":["ઈ"],"ઈ":["ઇ"],
                     "અ":["આ"],"આ":["અ"],"એ":["ઐ"],"ઐ":["એ"],"ઓ":["ઔ"],"ઔ":["ઓ"],"ગ":["ઞ"],"ઞ":["ગ"],
                     "ટ":["ઢ","ડ"],"ડ":["ઽ","ટ","ઙ"],"ઢ":["ટ"],"ઽ":["ડ"],"ઙ":["ડ"]
                    }
    if lang in ['pa']:
        homoglyph = {"ਖ":["ਪ"],"ਪ":["ਖ","੫","ਧ"],"੫":["ਪ"],"ਧ":["ਪ","ਥ"],"ਥ":["ਧ","ਬ","ਖ"],"ਬ":["ਥ"],"ਖ":["ਥ"],
                     "ਠ":["ਨ"],"ਨ":["ਠ"],"ਟ":["ਣ"],"ਣ":["ਟ"],"ਢ":["ਦ"],"ਦ":["ਢ"],"ਮ":["ਸ"],"ਸ":["ਮ"],"ਹ":["ਰ"],"ਰ":["ਹ"],
                     "ਅ":["ਆ"],"ਆ":["ਅ"],"ਐ":["ਔ"],"ਔ":["ਐ"],"ਵ":["ਞ"],"ਞ":["ਵ"],"ਤ":["ਭ"],"ਭ":["ਤ"],
                    }
    if lang in ['ta']:
        homoglyph = {"ஒ":["ஓ"],"ஓ":["ஒ"],"எ":["௭","ஏ"],"௭":["எ"],"ஏ":["எ"],"க":["௧","த"],"௧":["க"],"த":["க"],
                     "அ":["ஆ","௮"],"ஆ":["அ"],"௮":["அ"]
                    }
    if lang in ['ml']:
        homoglyph = {"ഠ":["൦"],"൦":["ഠ"],"ഖ":["വ"],"വ":["ഖ","പ"],"പ":["വ"],"ഗ":["ശ"],"ശ":["ഗ"],
                    "ഡ":["ഢ","ധ"],"ഢ":["ഡ"],"ധ":["ഡ"],"അ":["ആ"],"ആ":["അ"],"ദ":["ഭ"],"ഭ":["ദ"],
                    "ഋ":["ൠ"],"ൠ":["ഋ"],"ഌ":["ൡ"],"ൡ":["ഌ"],"ന":["ഩ","൩","സ","ത"],"ഩ":["ന"],
                    "൩":["ന"],"സ":["ന"],"റ":["൨"],"൨":["റ"],"ത":["ന"]
                    }
    if lang in ['kn']:
        homoglyph = {"ಅ":["ಆ"],"ಆ":["ಅ"],"ಇ":["ಞ"],"ಞ":["ಇ"],"ಎ":["ಏ"],"ಏ":["ಎ","ಐ"],"ಐ":["ಏ"],
                    "ಖ":["೩"],"೩":["ಖ"],"ಠ":["ರ"],"ರ":["ಠ"],"ಡ":["ಢ"],"ಢ":["ಡ"],
                    "ಥ":["ದ","ಧ"],"ದ":["ಥ","ಧ"],"ಧ":["ಥ","ದ"],"ಪ":["ಫ"],"ಫ":["ಪ"],
                     "ಬ":["ಭ"],"ಭ":["ಬ"],"ಒ":["ಓ"],"ಓ":["ಒ"]
                    }
    if lang in ['or']:
        homoglyph = {"ଅ":["ଆ"],"ଆ":["ଅ","ଥ"],"ଥ":["ଅ"],"ଉ":["ଊ"],"ଊ":["ଉ"],"ଖ":["ଗ"],"ଗ":["ଖ"],
                     "ଚ":["ଟ","ବ","ର"],"ଟ":["ଚ","ବ"],"ବ":["ଚ","ଟ"],"ର":["ଚ"],"ଠ":["୦"],"୦":["ଠ"],
                     "ଇ":["ଈ"],"ଈ":["ଇ"],"ଙ":["ଡ"],"ଡ":["ଙ","ତ","ଦ"],"ତ":["ଡ","ଦ"],"ଦ":["ତ","ଡ"],
                     "ଯ":["ପ","ଫ"],"ପ":["ଯ","ଫ","ଷ"],"ଫ":["ଯ","ପ"],"ଷ":["ପ"]}                                         
    if lang in ['te']:
          homoglyph = {"అ":["ఆ","ఱ"],"ఆ":["అ"],"ఱ":["ఱ"],"ఇ":["ఞ"],"ఞ":["ఇ"],
                       "ఎ":["ఏ"],"ఏ":["ఎ"],"ఒ":["ఓ","జ"],"ఓ":["ఒ","జ"],"జ":["ఒ","ఓ"],
                       "చ":["ఛ"],"ఛ":["చ"],"డ":["ఢ"],"ఢ":["డ"],
                       "థ":["ద","ధ"],"ద":["థ","ధ"],"ధ":["థ","ద"],"ప":["ఫ"],"ఫ":["ప"],
                       "బ":["భ"],"భ":["బ"],"ఠ":["ర"],"ర":["ఠ"],"వ":["ష"],"ష":["వ"]                          
          }                                                              
    return homoglyph

import pickle

def serialize(item, path):
    pickle.dump(item, open(path, "wb" ))

def deserialize(path):
    return pickle.load(open(path, "rb" ))
